---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolUserDefined
source: html/fe698c55-f209-acd4-afd1-14223f7be0f4.htm
---
# Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolUserDefined Property

The id of the FamilySymbol to represent a user-defined boundary condition.

## Syntax (C#)
```csharp
public ElementId BoundaryConditionFamilySymbolUserDefined { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null